#+title: Extracting Emacs LIMPLE (Native Compilation)

So, instead of re-building a bytecode analyzer (see [[file:Bytecode.org]]), it is
best we utilize what Emacs' =native-comp= provides: it converts Emacs bytecode
into LIMPLE, an intermediate representation (IR) suitable for =libgccjit=. If we
are to use Truffle bytecode DSL, LIMPLE is definitely more convenient than
bytecode. And this document aims to extract specification for LIMPLE similar to
what [[file:Bytecode.org]] does.

* LIMPLE Operators

One may think of LIMPLE as structured bytecode, and it also consists of various
"instructions". Each instruction is a list, led by a symbol - an operator.

These operators are defined in =comp-common.el=, with =comp-limple-ops= holding
all of them:

#+begin_src elisp
  (require 'comp-common)
  (require 'cl-macs)
  (defvar op-return '(return))
  (let* ((op-table '((op-return
                      comp-limple-calls
                      comp-limple-assignments
                      comp-limple-branches)))
         (op-lists (mapcar #'symbol-value (car op-table)))
         (table-height (apply #'max (mapcar #'length op-lists))))
    (let ((all-ops (apply #'append op-lists)))
      (cl-assert (equal (sort comp-limple-ops) (sort all-ops))))
    (dotimes (i table-height (nreverse op-table))
      (push (mapcar (lambda (list)
                      (let ((op (nth i list)))
                        (if op (format "=%S=" op) "")))
                    op-lists)
            op-table)))
#+end_src

#+RESULTS:
| op-return | comp-limple-calls | comp-limple-assignments  | comp-limple-branches |
| =return=  | =call=            | =assume=                 | =jump=               |
|           | =callref=         | =fetch-handler=          | =cond-jump=          |
|           | =direct-call=     | =set=                    |                      |
|           | =direct-callref=  | =setimm=                 |                      |
|           |                   | =set-par-to-local=       |                      |
|           |                   | =set-args-to-local=      |                      |
|           |                   | =set-rest-args-to-local= |                      |

** From Lisp Through C Back To Lisp

Because most of the structs (like =comp-ctxt=) are defined with =cl-defstruct=,
=comp.c= makes heavy use of macros like =CALL1I, CALL2I, CALL3I, ...= so as to
access fields in these structs. Let's try to extract what Lisp function it
calls:

#+begin_src elisp
  (defvar CALLNI-functions nil)
  (with-temp-buffer
    (insert-file-contents "../elisp/emacs/src/comp.c")
    (goto-char (point-min))
    (let (functions)
      (while (search-forward-regexp "CALL\\([0-9N]\\)I[[:space:]]*(\\([^,)]+\\)\\(:?,\\|)\\)" nil t)
        (let ((function (string-trim (match-string 2)))
              (n (read (match-string 1))))
          (when (not (string= function "fun"))
            (push (list n function) functions))))
      (setq CALLNI-functions (seq-uniq (sort functions :key #'cadr)))
      (cons (list "CALL[N]I" "Function Name") CALLNI-functions)))
#+end_src

#+RESULTS:
| CALL[N]I | Function Name                 |
|        0 | backtrace                     |
|        2 | cl-typep                      |
|        1 | comp-args-max                 |
|        1 | comp-block-insns              |
|        1 | comp-clean-up-stale-eln       |
|        1 | comp-cstr-imm                 |
|        1 | comp-cstr-imm-vld-p           |
|        1 | comp-ctxt-byte-func-to-func-h |
|        1 | comp-ctxt-compiler-options    |
|        1 | comp-ctxt-d-default           |
|        1 | comp-ctxt-d-ephemeral         |
|        1 | comp-ctxt-d-impure            |
|        1 | comp-ctxt-debug               |
|        1 | comp-ctxt-driver-options      |
|        1 | comp-ctxt-funcs-h             |
|        1 | comp-ctxt-function-docs       |
|        1 | comp-ctxt-speed               |
|        1 | comp-data-container-idx       |
|        1 | comp-data-container-l         |
|        2 | comp-delete-or-replace-file   |
|        1 | comp-func-blocks              |
|        1 | comp-func-c-name              |
|        1 | comp-func-frame-size          |
|        1 | comp-func-has-non-local       |
|        1 | comp-func-l-args              |
|        1 | comp-func-l-p                 |
|        1 | comp-func-name                |
|        1 | comp-func-safety              |
|        1 | comp-func-speed               |
|        1 | comp-mvar-slot                |
|        2 | comp-mvar-type-hint-match-p   |
|        1 | comp-nargs-p                  |
|        1 | file-name-base                |
|        1 | file-name-sans-extension      |
|        1 | hash-table-count              |
|        2 | make-directory                |
|        4 | make-temp-file                |
|        1 | split-string                  |

We want to know what fields in these =cl-struct= objects the compiler needs
access to (so as to write our compiler), so let's try to extract them out of
these function names:

#+begin_src elisp :wrap details
  (require 'pcase)
  (with-temp-buffer
    (pcase-dolist (`(,n ,name) CALLNI-functions)
      (when (string-prefix-p "comp-" name)
        (let* ((symbol (intern-soft name))
               (function (symbol-function symbol))
               (doc (function-documentation function))
               (doc-parts (if doc (string-split doc "\n\n") '("nil" "(fn ...)")))
               (doc (string-replace "\n" "\n  "(car doc-parts)))
               (sig (string-replace "fn" name (cadr doc-parts))))
          (cl-assert (and symbol function))
          (cl-assert (length= doc-parts 2))
          (insert (format "- =%s= ::\n  %s\n" sig doc)))))
    (pcase-dolist (`(,regexp . ,replace)
                   '(("`\\([A-Za-z-]+\\)'" . "=\\1=")
                     ("\n[[:space:]]+" . "\n  ")))
      (goto-char (point-min))
      (while (re-search-forward regexp nil t)
        (replace-match replace nil nil)))
    (buffer-string))
#+end_src

#+RESULTS:
#+begin_details
- =(comp-args-max CL-X)= ::
  Access slot "max" of =comp-args= struct CL-X.
  Maximum number of arguments allowed.
- =(comp-block-insns CL-X)= ::
  Access slot "insns" of =comp-block= struct CL-X.
  List of instructions.
- =(comp-clean-up-stale-eln FILE)= ::
  Remove all FILE*.eln* files found in =native-comp-eln-load-path=.
  The files to be removed are those produced from the original source
  filename (including FILE).
- =(comp-cstr-imm CSTR)= ::
  Return the immediate value of CSTR.
  =comp-cstr-imm-vld-p= *must* be satisfied before calling
  =comp-cstr-imm=.
- =(comp-cstr-imm-vld-p CSTR)= ::
  Return t if one and only one immediate value can be extracted from CSTR.
- =(comp-ctxt-byte-func-to-func-h CL-X)= ::
  Access slot "byte-func-to-func-h" of =comp-ctxt= struct CL-X.
  byte-function -> comp-func.
  Needed to replace immediate byte-compiled lambdas with the compiled reference.
- =(comp-ctxt-compiler-options CL-X)= ::
  Access slot "compiler-options" of =comp-ctxt= struct CL-X.
  Options for the GCC compiler.
- =(comp-ctxt-d-default CL-X)= ::
  Access slot "d-default" of =comp-ctxt= struct CL-X.
  Standard data relocated in use by functions.
- =(comp-ctxt-d-ephemeral CL-X)= ::
  Access slot "d-ephemeral" of =comp-ctxt= struct CL-X.
  Relocated data not necessary after load.
- =(comp-ctxt-d-impure CL-X)= ::
  Access slot "d-impure" of =comp-ctxt= struct CL-X.
  Relocated data that cannot be moved into pure space.
  This is typically for top-level forms other than defun.
- =(comp-ctxt-debug CL-X)= ::
  Access slot "debug" of =comp-ctxt= struct CL-X.
  Default debug level for this compilation unit.
- =(comp-ctxt-driver-options CL-X)= ::
  Access slot "driver-options" of =comp-ctxt= struct CL-X.
  Options for the GCC driver.
- =(comp-ctxt-funcs-h CL-X)= ::
  Access slot "funcs-h" of =comp-ctxt= struct CL-X.
  c-name -> comp-func.
- =(comp-ctxt-function-docs CL-X)= ::
  Access slot "function-docs" of =comp-ctxt= struct CL-X.
  Documentation index -> documentation
- =(comp-ctxt-speed CL-X)= ::
  Access slot "speed" of =comp-ctxt= struct CL-X.
  Default speed for this compilation unit.
- =(comp-data-container-idx CL-X)= ::
  Access slot "idx" of =comp-data-container= struct CL-X.
  Obj -> position into the previous field.
- =(comp-data-container-l CL-X)= ::
  Access slot "l" of =comp-data-container= struct CL-X.
  Constant objects used by functions.
- =(comp-delete-or-replace-file OLDFILE &optional NEWFILE)= ::
  Replace OLDFILE with NEWFILE.
  When NEWFILE is nil just delete OLDFILE.
  Takes the necessary steps when dealing with OLDFILE being a
  shared library that might be currently loaded into a running Emacs
  session.
- =(comp-func-blocks CL-X)= ::
  Access slot "blocks" of =comp-func= struct CL-X.
  Basic block symbol -> basic block.
- =(comp-func-c-name CL-X)= ::
  Access slot "c-name" of =comp-func= struct CL-X.
  The function name in the native world.
- =(comp-func-frame-size CL-X)= ::
  Access slot "frame-size" of =comp-func= struct CL-X.
- =(comp-func-has-non-local CL-X)= ::
  Access slot "has-non-local" of =comp-func= struct CL-X.
  t if non local jumps are present.
- =(comp-func-l-args CL-X)= ::
  Access slot "args" of =comp-func-l= struct CL-X.
  Argument specification of the function
- =(comp-func-l-p ...)= ::
  nil
- =(comp-func-name CL-X)= ::
  Access slot "name" of =comp-func= struct CL-X.
  Function symbol name. Nil indicates anonymous.
- =(comp-func-safety CL-X)= ::
  Access slot "safety" of =comp-func= struct CL-X.
  Safety level (see =safety=).
- =(comp-func-speed CL-X)= ::
  Access slot "speed" of =comp-func= struct CL-X.
  Optimization level (see =native-comp-speed=).
- =(comp-mvar-slot CL-X)= ::
  Access slot "slot" of =comp-mvar= struct CL-X.
  Slot number in the array if a number or
  =scratch= for scratch slot.
- =(comp-mvar-type-hint-match-p MVAR TYPE-HINT)= ::
  Match MVAR against TYPE-HINT.
  In use by the back-end.
- =(comp-nargs-p ...)= ::
  nil
#+end_details

These functions can be roughly categorized:

- The actual code:

  - Instructions:
    - =comp-ctxt-funcs-h=
    - =comp-func-blocks=
    - =comp-block-insns=

  - Signature:
    - =comp-args-max=
    - =comp-nargs-p=
    - =comp-func-frame-size=
    - =comp-func-has-non-local=
    - =comp-func-l-args=
      - =comp-func-l-p=

- Values:
  - =comp-cstr-imm=
  - =comp-cstr-imm-vld-p=
  - =comp-mvar-slot=
  - =comp-mvar-type-hint-match-p=

- Relocation:

  - =comp-ctxt-d-default=
  - =comp-ctxt-d-ephemeral=
  - =comp-ctxt-d-impure=
  - =comp-data-container-idx=
  - =comp-data-container-l=

And these (and especially relocation) are what we will focus when reading
=comp.c=.

